{
  "products": [
    {
      "id": 1,
      "name": "Cheeseburger",
      "description": "Juicy beef patty with melted cheddar cheese, crispy bacon, lettuce, tomato, onion, and special sauce on a soft bun.",
      "shortdesc": "Juicy beef patty",
      "heading": "Here's a simple recipe to make a delicious cheeseburger:",
      "recipe": "1. Preheat a grill or stovetop pan over medium heat.\n\n2. Shape ground beef into patties, season with salt and pepper.\n\n3. Cook the patties for about 4-5 minutes per side until desired doneness.\n\n4. Toast the buns on the grill or in a toaster.\n\n5. Place a slice of cheddar cheese on each patty to melt.\n\n6. Assemble the burger by placing the patty on the bottom bun.\n\n7. Top it with crispy bacon, lettuce, tomato slices, and onion.\n\n8. Spread the special sauce on the top bun and place it on top of the toppings.\n\n9. Serve immediately and enjoy your homemade cheeseburger!\n\n10. Enjoy!",
      "price": 100,
      "stars": 160,
      "color": "#33505a",
      "image": "assets/images/foods/Cheeseburger.jpg",
      "restaurant": "Burger Joint",
      "location": "Cityville",
      "flavor": "Savory"
    },
    {
      "id": 2,
      "name": "Chicken Biryani",
      "description": "A flavorful and aromatic rice dish made with basmati rice, tender chicken pieces, and a blend of spices. It is a popular Indian dish, known for its rich taste and unique blend of flavors.",
      "shortdesc": "Aromatic rice with tender chicken",
      "heading": "Here's a simple recipe to make delicious Chicken Biryani:",
      "recipe": "1. Marinate chicken pieces with yogurt, ginger-garlic paste, turmeric powder, red chili powder, garam masala, and salt. Let it marinate for at least 1 hour.\n2. Heat oil and ghee in a large pan or pot.\n3. Add whole spices like cinnamon, cardamom, cloves, and bay leaves. Sauté for a minute until fragrant.\n4. Add chopped onions and cook until golden brown.\n5. Add ginger-garlic paste and cook for a minute.\n6. Add marinated chicken and cook until it is partially cooked.\n7. Add soaked basmati rice, water, and salt. Mix well.\n8. Cover the pan and cook on low heat until the rice and chicken are fully cooked.\n9. Garnish with fried onions, fresh coriander leaves, and mint leaves.\n10. Serve the Chicken Biryani hot with raita or salan (spicy gravy) and enjoy the aromatic flavors.",
      "price": 150,
      "stars": 1000,
      "color": "#228B22",
      "image": "assets/images/foods/ChickenBiryani.jpg",
      "restaurant": "Biryani House",
      "location": "Hyderabad",
      "flavor": "Spicy and aromatic"
    },
    {
      "id": 3,
      "name": "Veg Noodles",
      "description": "A popular dish made with stir-fried noodles, fresh vegetables, and a savory sauce. It can be prepared with various styles such as Chow Mein, Hakka Noodles, or Pad Thai, offering a range of flavors and textures.",
      "shortdesc": "Stir-fried noodles with vegetables",
      "heading": "Here's a simple recipe to make delicious Noodles:",
      "recipe": "1. Boil water in a pot and cook noodles as per package instructions.\n2. Heat oil in a pan and add chopped garlic and ginger.\n3. Add sliced onions, bell peppers, carrots, and any other desired vegetables. Stir-fry until they are tender-crisp.\n4. Add cooked noodles to the pan and toss well.\n5. In a bowl, mix soy sauce, vinegar, chili sauce, and a pinch of sugar.\n6. Pour the sauce mixture over the noodles and vegetables. Toss to combine.\n7. Garnish with chopped spring onions.\n8. Serve hot and enjoy your delicious Noodles!",
      "price": 80,
      "stars": 300,
      "color": "#FFA500",
      "image": "assets/images/foods/VegNoodles.jpg",
      "restaurant": "Wok & Roll",
      "location": "Noodle City",
      "flavor": "Savory and tangy"
    },
    {
      "id": 4,
      "name": "Ghee Dosa",
      "description": "A crispy and flavorful South Indian pancake made from fermented rice and lentil batter, cooked with ghee (clarified butter). Ghee dosa is a popular breakfast or snack option loved for its texture and taste.",
      "shortdesc": "Crispy pancake with ghee",
      "heading": "Here's a simple recipe to make delicious Ghee Dosa:",
      "recipe": "1. For the dosa batter, soak rice, urad dal, and fenugreek seeds in water separately for a few hours. Grind them together with water to make a smooth batter. Ferment the batter overnight.\n2. Heat a tawa or griddle and spread a ladleful of dosa batter in a circular motion to form a thin pancake.\n3. Drizzle ghee around the edges and on top of the dosa. Cook until the dosa turns golden brown and crispy.\n4. Flip the dosa and cook the other side for a minute.\n5. Serve hot ghee dosa with sambar, coconut chutney, or your favorite side dish!",
      "price": 75,
      "stars": 500,
      "color": "#DAA520",
      "image": "assets/images/foods/GheeDosa.jpg",
      "restaurant": "Dosa Corner",
      "location": "South India",
      "flavor": "Crispy and flavorful"
    },
    {
      "id": 5,
      "name": "Samosas with Meat",
      "description": "Crispy and savory triangular pastries filled with a delicious mixture of spiced ground meat (such as beef or chicken) and vegetables. Samosas with meat are a popular snack or appetizer in many cuisines.",
      "shortdesc": "Crispy pastries with meat filling",
      "heading": "Here's a simple recipe to make delicious Samosas with Meat:",
      "recipe": "1. For the dough, mix all-purpose flour, salt, and vegetable oil in a bowl. Gradually add water and knead until the dough is smooth. Let it rest for 30 minutes.\n2. For the filling, heat oil in a pan, add onions, garlic, and ginger. Sauté until onions turn translucent.\n3. Add ground meat (beef or chicken), turmeric powder, cumin powder, coriander powder, red chili powder, garam masala, and salt. Cook until the meat is browned and cooked through.\n4. Add peas, carrots, and potatoes. Cook for a few more minutes until the vegetables are tender.\n5. Divide the dough into small balls and roll each ball into a thin circle.\n6. Cut the circle in half and shape each half into a cone. Fill the cone with the meat filling.\n7. Seal the edges of the cone by brushing with water and pressing them together.\n8. Deep fry the samosas until they turn golden brown and crispy.\n9. Serve hot samosas with mint chutney or your favorite dipping sauce!",
      "price": 70,
      "stars": 300,
      "color": "#FF4500",
      "image": "assets/images/foods/SamosasWithMeat.jpg",
      "restaurant": "Spice Junction",
      "location": "Various",
      "flavor": "Savory and delicious"
    },
    {
      "id": 6,
      "name": "Tomato Pizza",
      "description": "A classic pizza topped with tangy tomato sauce, melted cheese, and your favorite toppings. Tomato pizza is a popular choice for pizza lovers around the world.",
      "shortdesc": "Classic pizza with tomato sauce",
      "heading": "Here's a simple recipe to make delicious Tomato Pizza:",
      "recipe": "1. For the pizza dough, combine all-purpose flour, yeast, sugar, salt, and olive oil in a bowl. Gradually add water and knead until the dough is smooth. Let it rise for 1-2 hours.\n2. Preheat the oven to the desired temperature (usually 475°F or 245°C).\n3. Roll out the dough into a circle or rectangle of your preferred thickness.\n4. Spread tomato sauce evenly over the dough, leaving a border for the crust.\n5. Sprinkle shredded mozzarella cheese and your favorite toppings (such as vegetables, meats, or herbs) over the sauce.\n6. Bake the pizza in the preheated oven for about 12-15 minutes, or until the crust is golden brown and the cheese is melted and bubbly.\n7. Remove from the oven, slice, and serve hot!",
      "price": 100,
      "stars": 50,
      "color": "#FFA500",
      "image": "assets/images/foods/TomatoPizza.jpg",
      "restaurant": "Pizza Paradise",
      "location": "Various",
      "flavor": "Classic and tangy"
    },
    {
      "id": 7,
      "name": "Chapati Bean Stew",
      "description": "A hearty and flavorful dish made with whole wheat chapatis (Indian flatbreads) served with a delicious bean stew. It is a nutritious and satisfying meal packed with protein and fiber.",
      "shortdesc": "Indian flatbreads with bean stew",
      "heading": "Here's a simple recipe to make delicious Chapati Bean Stew:",
      "recipe": "1. For chapatis, mix whole wheat flour, water, and salt in a bowl to make a dough. Knead the dough until smooth and let it rest for 30 minutes.\n2. Divide the dough into small balls and roll each ball into a thin circle.\n3. Heat a tawa or skillet and cook the chapatis on both sides until they puff up and have golden brown spots.\n4. For the bean stew, heat oil in a pan, add onions, garlic, and ginger. Sauté until onions turn golden brown.\n5. Add tomatoes, cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Cook until the tomatoes are soft and the spices are well blended.\n6. Add cooked beans (kidney beans, black beans, or any other beans of your choice) and water. Simmer for 10-15 minutes.\n7. Garnish with fresh cilantro and serve hot chapatis with the flavorful bean stew!",
      "price": 90,
      "stars": 100,
      "color": "#8B4513",
      "image": "assets/images/foods/ChapatiBeanStew.jpg",
      "restaurant": "Spicy Delights",
      "location": "India",
      "flavor": "Hearty and flavorful"
    },
    {
      "id": 8,
      "name": "Club Sandwich",
      "description": "A classic sandwich made with layers of toasted bread, lettuce, tomato, bacon, chicken or turkey slices, and mayonnaise. It is a popular choice for a quick and satisfying meal or snack.",
      "shortdesc": "Classic layered sandwich",
      "heading": "Here's a simple recipe to make delicious Club Sandwich:",
      "recipe": "1. Toast bread slices until crisp and golden brown.\n2. Spread mayonnaise on one side of each bread slice.\n3. Layer lettuce leaves, tomato slices, cooked bacon, and chicken or turkey slices on one bread slice.\n4. Top with another bread slice and repeat the layering process.\n5. Finish with a final bread slice and secure the sandwich with toothpicks.\n6. Cut the sandwich into quarters or triangles.\n7. Serve the Club Sandwich with your favorite accompaniments and enjoy!",
      "price": 70,
      "stars": 120,
      "color": "#FF8C00",
      "image": "assets/images/foods/ClubSandwich.jpg",
      "restaurant": "Sandwich Delight",
      "location": "Cityville",
      "flavor": "Savory and satisfying"
    },
    {
      "id": 9,
      "name": "Butter Chicken",
      "description": "A popular North Indian dish made with succulent chicken pieces cooked in a rich and creamy tomato-based gravy. It is typically served with naan bread or rice and enjoyed for its flavorful and aromatic taste.",
      "shortdesc": "Chicken in rich tomato gravy",
      "heading": "Here's a simple recipe to make delicious Butter Chicken:",
      "recipe": "1. Marinate chicken pieces with yogurt, ginger-garlic paste, turmeric powder, red chili powder, and salt. Let it marinate for at least 30 minutes.\n2. Heat oil and butter in a pan, add onions and cook until golden brown.\n3. Add tomato puree, ginger-garlic paste, turmeric powder, red chili powder, garam masala, and salt. Cook until the oil separates.\n4. Add marinated chicken and cook until it is cooked through.\n5. Stir in fresh cream and cook for a few more minutes.\n6. Garnish with fresh coriander leaves and a dollop of butter.\n7. Serve hot with naan bread, rice, or roti and enjoy the delectable Butter Chicken!",
      "price": 120,
      "stars": 200,
      "color": "#8B4513",
      "image": "assets/images/foods/ButterChicken.jpg",
      "restaurant": "Spice Junction",
      "location": "Punjab",
      "flavor": "Rich and creamy"
    },
    {
      "id": 10,
      "name": "Grilled Cheese Sandwich",
      "description": "A classic sandwich made with slices of cheese melted between two buttered and grilled bread slices. It is simple yet delicious, loved by people of all ages.",
      "shortdesc": "Melted cheese between grilled bread",
      "heading": "Here's a simple recipe to make a tasty Grilled Cheese Sandwich:",
      "recipe": "1. Butter one side of each bread slice.\n2. Place slices of cheese between the unbuttered sides of the bread slices.\n3. Heat a pan or griddle over medium heat.\n4. Place the sandwich on the heated pan and cook until the bread is golden brown and crispy.\n5. Flip the sandwich and cook the other side until it is golden brown and the cheese is melted.\n6. Remove from the heat and let it cool for a minute.\n7. Cut the sandwich diagonally or into halves.\n8. Serve the Grilled Cheese Sandwich with tomato soup or your favorite condiments.",
      "price": 50,
      "stars": 150,
      "color": "#FFD700",
      "image": "assets/images/foods/GrilledCheeseSandwich.jpg",
      "restaurant": "Cheesy Delights",
      "location": "Cityville",
      "flavor": "Cheesy and comforting"
    }
  ]
}