{
  "products": [
    {
      "id": 1,
      "name": "Cheeseburger",
      "description": "Juicy beef patty with melted cheddar cheese, crispy bacon, lettuce, tomato, onion, and special sauce on a soft bun.",
      "shortdesc": "Juicy beef patty",
      "heading": "Here's a simple recipe to make a delicious cheeseburger:",
      "recipe": "1. Preheat a grill or stovetop pan over medium heat.\n2. Shape ground beef into patties, season with salt and pepper.\n3. Cook the patties for about 4-5 minutes per side until desired doneness.\n4. Toast the buns on the grill or in a toaster.\n5. Place a slice of cheddar cheese on each patty to melt.\n6. Assemble the burger by placing the patty on the bottom bun.\n7. Top it with crispy bacon, lettuce, tomato slices, and onion.\n8. Spread the special sauce on the top bun and place it on top of the toppings.\n9. Serve immediately and enjoy your homemade cheeseburger!\n10. Enjoy!",
      "price": 100,
      "color": "#33505a",
      "image": "assets/images/foods/Cheeseburger.jpg",
      "restaurant": "Burger Joint",
      "location": "Cityville",
      "flavor": "Savory"
    },
    {
      "id": 2,
      "name": "Biryani",
      "description": "A flavorful rice dish made with aromatic basmati rice, tender meat (such as chicken, lamb, or fish), fragrant spices, and saffron. It is cooked in a traditional way to create a delicious and aromatic one-pot meal.",
      "shortdesc": "Aromatic rice dish with tender meat",
      "heading": "Here's a simple recipe to make delicious Biryani:",
      "recipe": "1. Wash and soak basmati rice for 30 minutes.\n2. Heat oil in a pan and add whole spices (such as cinnamon, cardamom, and cloves) for tempering.\n3. Add chopped onions and sauté until golden brown.\n4. Add ginger-garlic paste and cook until the raw smell disappears.\n5. Add marinated meat and cook until it is partially cooked.\n6. Add yogurt, biryani masala, and salt. Mix well.\n7. Add soaked rice, water, and saffron strands.\n8. Cover and cook on low heat until the rice is fully cooked and the flavors are infused.\n9. Garnish with fried onions, mint leaves, and chopped coriander.\n10. Serve hot with raita and enjoy your flavorful Biryani!",
      "price": 150,
      "color": "#8B4513",
      "image": "assets/images/foods/Biryani.jpg",
      "restaurant": "Spice Paradise",
      "location": "Spice Town",
      "flavor": "Spicy and aromatic"
    },
    {
      "id": 3,
      "name": "Noodles",
      "description": "A popular dish made with stir-fried noodles, fresh vegetables, and a savory sauce. It can be prepared with various styles such as Chow Mein, Hakka Noodles, or Pad Thai, offering a range of flavors and textures.",
      "shortdesc": "Stir-fried noodles with vegetables",
      "heading": "Here's a simple recipe to make delicious Noodles:",
      "recipe": "1. Boil water in a pot and cook noodles as per package instructions.\n2. Heat oil in a pan and add chopped garlic and ginger.\n3. Add sliced onions, bell peppers, carrots, and any other desired vegetables. Stir-fry until they are tender-crisp.\n4. Add cooked noodles to the pan and toss well.\n5. In a bowl, mix soy sauce, vinegar, chili sauce, and a pinch of sugar.\n6. Pour the sauce mixture over the noodles and vegetables. Toss to combine.\n7. Garnish with chopped spring onions.\n8. Serve hot and enjoy your delicious Noodles!",
      "price": 80,
      "color": "#FFA500",
      "image": "assets/images/foods/Noodles.jpg",
      "restaurant": "Wok & Roll",
      "location": "Noodle City",
      "flavor": "Savory and tangy"
    },
    {
      "id": 4,
      "name": "Porotta",
      "description": "A layered flatbread made with all-purpose flour, ghee, and water. It is flaky, soft, and commonly enjoyed with curries or as a standalone dish.",
      "shortdesc": "Flaky layered flatbread",
      "heading": "Here's a simple recipe to make delicious Porotta:",
      "recipe": "1. In a mixing bowl, combine all-purpose flour, salt, and water to form a soft dough.\n2. Knead the dough well until it becomes smooth and elastic.\n3. Divide the dough into small balls and roll each ball into a thin circle.\n4. Apply ghee on the rolled circle and fold it into a pleated strip.\n5. Coil the strip into a spiral shape and tuck the end.\n6. Repeat the process with the remaining dough balls.\n7. Heat a griddle or tawa and cook each porotta on medium heat.\n8. Flip the porotta and cook until both sides are golden brown.\n9. Serve hot with your favorite curry or side dish and enjoy your tasty Porotta!",
      "price": 30,
      "color": "#FFD700",
      "image": "assets/images/foods/Porotta.jpg",
      "restaurant": "Taste of Kerala",
      "location": "Kerala",
      "flavor": "Flaky and buttery"
    },
    {
      "id": 5,
      "name": "Dhokla",
      "description": "A steamed savory cake made from fermented batter of gram flour (besan), yogurt, and spices. It is light, fluffy, and often served with chutney as a popular snack or breakfast item in Gujarat, India.",
      "shortdesc": "Steamed savory cake",
      "heading": "Here's a simple recipe to make delicious Dhokla:",
      "recipe": "1. In a bowl, mix gram flour, yogurt, and water to make a smooth batter.\n2. Add turmeric powder, ginger-green chili paste, salt, and lemon juice to the batter. Mix well.\n3. Grease a steamer plate or tray with oil.\n4. Pour the batter into the greased plate and steam for about 15-20 minutes until cooked.\n5. Meanwhile, prepare a tempering by heating oil in a pan and adding mustard seeds, curry leaves, and green chilies. Let them crackle.\n6. Remove the steamed dhokla from the plate and cut it into pieces.\n7. Pour the tempering over the dhokla pieces.\n8. Garnish with chopped coriander leaves and grated coconut.\n9. Serve with green chutney or tamarind chutney and enjoy your flavorful Dhokla!",
      "price": 40,
      "color": "#FF4500",
      "image": "assets/images/foods/Dhokla.jpg",
      "restaurant": "Gujarati Delights",
      "location": "Gujarat",
      "flavor": "Tangy and savory"
    },
    {
      "id": 6,
      "name": "Vada Pav",
      "description": "A popular street food from Maharashtra, India, consisting of a spicy potato fritter (vada) served in a bun (pav) with chutneys. It is flavorful and commonly enjoyed as a quick snack.",
      "shortdesc": "Spicy potato fritter in a bun",
      "heading": "Here's a simple recipe to make delicious Vada Pav:",
      "recipe": "1. Boil, peel, and mash potatoes. Add ginger-garlic paste, green chilies, turmeric powder, red chili powder, salt, and coriander leaves. Mix well.\n2. Heat oil in a pan, add mustard seeds, cumin seeds, and curry leaves. Let them splutter.\n3. Add the potato mixture and cook for a few minutes until the spices are well incorporated.\n4. Shape the potato mixture into small patties and dip them in a batter made with gram flour, salt, turmeric powder, and water.\n5. Deep fry the potato patties until golden brown and crispy.\n6. Slit the pav buns, spread some garlic chutney and tamarind chutney on the inner sides.\n7. Place a vada in each pav and press gently.\n8. Serve hot with fried green chilies or chutney and enjoy your tasty Vada Pav!",
      "price": 25,
      "color": "#8B0000",
      "image": "assets/images/foods/VadaPav.jpg",
      "restaurant": "Mumbai Street Eats",
      "location": "Maharashtra",
      "flavor": "Spicy and tangy"
    },
    {
      "id": 7,
      "name": "Chole Bhature",
      "description": "A popular North Indian dish consisting of spicy chickpea curry (chole) served with deep-fried bread (bhature). It is a hearty and flavorful combination enjoyed as a main course or brunch.",
      "shortdesc": "Spicy chickpea curry with fried bread",
      "heading": "Here's a simple recipe to make delicious Chole Bhature:",
      "recipe": "1. Soak chickpeas overnight, then pressure cook them until soft.\n2. Heat oil in a pan, add cumin seeds, onions, and ginger-garlic paste. Sauté until onions turn golden brown.\n3. Add tomatoes, turmeric powder, red chili powder, coriander powder, garam masala, and salt. Cook until tomatoes are soft and oil separates.\n4. Add cooked chickpeas and cook for a few minutes. Mash some chickpeas to thicken the gravy.\n5. For bhature, mix all-purpose flour, yogurt, semolina, salt, and a pinch of baking powder. Knead into a soft dough.\n6. Divide the dough into small balls and roll each ball into a circle.\n7. Deep fry the rolled bhature until puffed and golden brown.\n8. Serve hot chole with bhature, sliced onions, and lemon wedges. Enjoy your flavorful Chole Bhature!",
      "price": 60,
      "color": "#FFA500",
      "image": "assets/images/foods/CholeBhature.jpg",
      "restaurant": "Punjabi Delights",
      "location": "Punjab",
      "flavor": "Savory"
    },
    {
      "id": 8,
      "name": "Appam with Stew",
      "description": "A traditional Kerala breakfast dish consisting of soft and fluffy rice pancakes (appam) served with a creamy and aromatic vegetable stew. It is a popular combination enjoyed for its unique taste and texture.",
      "shortdesc": "Rice pancakes with vegetable stew",
      "heading": "Here's a simple recipe to make delicious Appam with Stew:",
      "recipe": "1. For appam, soak raw rice and cooked rice in water separately for a few hours.\n2. Grind soaked raw rice, cooked rice, grated coconut, and yeast to make a smooth batter. Ferment the batter overnight.\n3. Heat an appam pan, pour a ladleful of batter, and swirl the pan to spread the batter evenly.\n4. Cover the pan and cook appam on low heat until the edges turn crisp and the center is soft and lacy.\n5. For stew, heat oil in a pan, add onions, ginger, and green chilies. Sauté until onions turn translucent.\n6. Add vegetables (carrots, potatoes, peas), turmeric powder, salt, and coconut milk. Cook until the vegetables are tender.\n7. For the tempering, heat oil in a small pan, add mustard seeds, curry leaves, and dried red chilies. Pour the tempering over the stew.\n8. Serve hot appam with vegetable stew and enjoy the delightful combination!",
      "price": 80,
      "color": "#2E8B57",
      "image": "assets/images/foods/AppamWithStew.jpg",
      "restaurant": "Kerala Kitchen",
      "location": "Kerala",
      "flavor": "Creamy and aromatic"
    },
    {
      "id": 9,
      "name": "Club Sandwich",
      "description": "A classic sandwich made with layers of toasted bread, lettuce, tomato, bacon, chicken or turkey slices, and mayonnaise. It is a popular choice for a quick and satisfying meal or snack.",
      "shortdesc": "Classic layered sandwich",
      "heading": "Here's a simple recipe to make delicious Club Sandwich:",
      "recipe": "1. Toast bread slices until crisp and golden brown.\n2. Spread mayonnaise on one side of each bread slice.\n3. Layer lettuce leaves, tomato slices, cooked bacon, and chicken or turkey slices on one bread slice.\n4. Top with another bread slice and repeat the layering process.\n5. Finish with a final bread slice and secure the sandwich with toothpicks.\n6. Cut the sandwich into quarters or triangles.\n7. Serve the Club Sandwich with your favorite accompaniments and enjoy!",
      "price": 70,
      "color": "#FF8C00",
      "image": "assets/images/foods/ClubSandwich.jpg",
      "restaurant": "Sandwich Delight",
      "location": "Cityville",
      "flavor": "Savory and satisfying"
    },
    {
      "id": 10,
      "name": "Butter Chicken",
      "description": "A popular North Indian dish made with succulent chicken pieces cooked in a rich and creamy tomato-based gravy. It is typically served with naan bread or rice and enjoyed for its flavorful and aromatic taste.",
      "shortdesc": "Chicken in rich tomato gravy",
      "heading": "Here's a simple recipe to make delicious Butter Chicken:",
      "recipe": "1. Marinate chicken pieces with yogurt, ginger-garlic paste, turmeric powder, red chili powder, and salt. Let it marinate for at least 30 minutes.\n2. Heat oil and butter in a pan, add onions and cook until golden brown.\n3. Add tomato puree, ginger-garlic paste, turmeric powder, red chili powder, garam masala, and salt. Cook until the oil separates.\n4. Add marinated chicken and cook until it is cooked through.\n5. Stir in fresh cream and cook for a few more minutes.\n6. Garnish with fresh coriander leaves and a dollop of butter.\n7. Serve hot with naan bread, rice, or roti and enjoy the delectable Butter Chicken!",
      "price": 120,
      "color": "#8B4513",
      "image": "assets/images/foods/ButterChicken.jpg",
      "restaurant": "Spice Junction",
      "location": "Punjab",
      "flavor": "Rich and creamy"
    },
    {
      "id": 11,
      "name": "Grilled Cheese Sandwich",
      "description": "A classic sandwich made with slices of cheese melted between two buttered and grilled bread slices. It is simple yet delicious, loved by people of all ages.",
      "shortdesc": "Melted cheese between grilled bread",
      "heading": "Here's a simple recipe to make a tasty Grilled Cheese Sandwich:",
      "recipe": "1. Butter one side of each bread slice.\n2. Place slices of cheese between the unbuttered sides of the bread slices.\n3. Heat a pan or griddle over medium heat.\n4. Place the sandwich on the heated pan and cook until the bread is golden brown and crispy.\n5. Flip the sandwich and cook the other side until it is golden brown and the cheese is melted.\n6. Remove from the heat and let it cool for a minute.\n7. Cut the sandwich diagonally or into halves.\n8. Serve the Grilled Cheese Sandwich with tomato soup or your favorite condiments.",
      "price": 50,
      "color": "#FFD700",
      "image": "assets/images/foods/GrilledCheeseSandwich.jpg",
      "restaurant": "Cheesy Delights",
      "location": "Cityville",
      "flavor": "Cheesy and comforting"
    },
    {
      "id": 12,
      "name": "Chicken Biryani",
      "description": "A flavorful and aromatic rice dish made with basmati rice, tender chicken pieces, and a blend of spices. It is a popular Indian dish, known for its rich taste and unique blend of flavors.",
      "shortdesc": "Aromatic rice with tender chicken",
      "heading": "Here's a simple recipe to make delicious Chicken Biryani:",
      "recipe": "1. Marinate chicken pieces with yogurt, ginger-garlic paste, turmeric powder, red chili powder, garam masala, and salt. Let it marinate for at least 1 hour.\n2. Heat oil and ghee in a large pan or pot.\n3. Add whole spices like cinnamon, cardamom, cloves, and bay leaves. Sauté for a minute until fragrant.\n4. Add chopped onions and cook until golden brown.\n5. Add ginger-garlic paste and cook for a minute.\n6. Add marinated chicken and cook until it is partially cooked.\n7. Add soaked basmati rice, water, and salt. Mix well.\n8. Cover the pan and cook on low heat until the rice and chicken are fully cooked.\n9. Garnish with fried onions, fresh coriander leaves, and mint leaves.\n10. Serve the Chicken Biryani hot with raita or salan (spicy gravy) and enjoy the aromatic flavors.",
      "price": 150,
      "color": "#228B22",
      "image": "assets/images/foods/ChickenBiryani.jpg",
      "restaurant": "Biryani House",
      "location": "Hyderabad",
      "flavor": "Spicy and aromatic"
    }
  ]
}